* About
=org-tracktable= is an emacs package for tracking writing progress in org-files and putting the results in an org-table.

More info will come.

* The table
#+NAME: tracktable
|---+------------------+------+------+------------+---------|
| ! | date             |  beg |  end |    written | comment |
|---+------------------+------+------+------------+---------|
|   | <2015-11-04 Wed> |    0 | 4311 | 4211 - end |         |
|   | <2015-11-04 Wed> | 4311 | 4211 |       -100 |         |
|   | <2015-11-04 Wed> | 4211 | 4208 |         -3 |         |
|   | <2015-11-04 Wed> | 4208 | 4210 |          2 |         |
|   | <2015-11-04 Wed> | 4197 | 4209 |      8.3.2 |         |
|   | <2015-11-04 Wed> | 4209 |  200 |          2 |         |
|   |                  | 3    |    4 |            |         |
|---+------------------+------+------+------------+---------|
#+TBLFM: $2='(org-insert-time-stamp (current-time))::$3=(@-1$4)::$4='(org-tt-current)::$5=$4-$3::@2$3=0
